InsideWCF/Chapter05/MessagesTest/!Messages/WriteMessageMethodTest.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://www.w3.org/2003/05/soap-envelope"><s:Header><a:Action s:mustUnderstand="1">SomeAction</a:Action><MyName xmlns="MyNamespace">MyValue</MyName></s:Header><s:Body><CPersonInfo xmlns:i="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://schemas.datacontract.org/2004/07/MessagesTest"><Age>12</Age><Name><FirstName>Timmy</FirstName><LastName>Anderson</LastName></Name></CPersonInfo></s:Body></s:Envelope>